#Вариант 16. Дано трехзначное число. Найти сумму и произведение его цифр
#Начало кода:
while True:
    try:
      a = int(input('Введите трехзначное число: '))   #ввод значений
    except ValueError: #исключение ошибок (буквы и символы).
      print("Ошибка! Вы ввели неверное значение. Попробуйте еще раз.")
    if not (100 <= a <= 999):
        print("Ошибка! Число должно быть трёхзначным. Попробуйте ещё раз.")
        continue #возвращение к началу цикла
    hun = a // 100 #Деление сотен (целочисленное)
    ten = (a // 10) % 10 #Деление десятков
    unts = a % 10 #деление едииниц
    sum = hun + ten + unts #Нахождение суммы
    mult = hun * ten * unts #Нахождение произбедения
    print(f"Число: {a} \nЗначения: {hun}, {ten}, {unts} \nСумма цифр: {sum} \nПроизведение цифр: {mult}")
    break #выход из цикла