#Вариант 16. Дано трехзначное число. Найти сумму и произведение его цифр
#Начало кода:
while True:
    try:
      a = int(input('Введите трехзначное число: '))
      if not (100 <= a <= 999):
          print("Ошибка! Число должно быть трёхзначным. Попробуйте ещё раз.")
          continue
      hun = a // 100
      ten = (a // 10) % 10
      unts = a % 10
      sum = hun + ten + unts
      mult = hun * ten * unts
      print(f"Число: {a} \nЗначения: {hun}, {ten}, {unts} \nСумма цифр: {sum} \nПроизведение цифр: {mult}")
      break
    except ValueError:
      print("Ошибка! Вы ввели неверное значение. Попробуйте еще раз.")