#Вариант 16. Дано трехзначное число. Найти сумму и произведение его цифр
#Начало кода:
while True: #бесконечный цикл
    try: #проверка ошибок
      a = int(input('Введите трехзначное число: '))   #ввод значений
    except ValueError: #исключение ошибок (буквы и символы).
      print("Ошибка! Вы ввели неверное значение. Попробуйте еще раз.") #текст к ошибке

    if not (100 <= a <= 999): #проверка числа на трехзначность
        print("Ошибка! Число должно быть трёхзначным. Попробуйте ещё раз.") #текст при невыполнении условия
        continue #возвращение к началу цикла
    break #выход из цикла

hun = a // 100  # Деление сотен (целочисленное)
ten = (a // 10) % 10  # Деление десятков
unts = a % 10  # деление едииниц
sum = hun + ten + unts  # Нахождение суммы
mult = hun * ten * unts  # Нахождение произбедения
print(f"Число: {a} \nЗначения: {hun}, {ten}, {unts} \nСумма цифр: {sum} \nПроизведение цифр: {mult}") #вывод реезультата